Autodesk.Revit.DB.ExportLinetypeKey.OriginalLinetypeName
The original linetype name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.ExportLinetypeKey.#ctor(System.String)
Constructs a new default ExportLinetypeKey using the original line type name as input.
originalLinetypeName:
The original line type name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.ExportLinetypeKey.#ctor(Autodesk.Revit.DB.ExportLinetypeKey)
Constructs a new copy of the input ExportLinetypeKey object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014